In [1]:
#code to generate example dataframe
"""
Given the following dataframe, write code using Python (Pandas) 
to return the rows that contain the string 'J' in the name column 
(to practice searching string contains).

Next, write code to return all rows where favorite_color does not contain the string 'r'.
"""
import pandas as pd
raw_data = {'age': [20, 19, 22, 21], 
        'favorite_color': ['blue', 'blue', 'yellow', 'green'], 
        'grade': [88, 95, 92, 70], 
        'name': ['Willard Morris', 'Al Jennings', 'Omar Mullins', 'Spencer McDaniel']}
df = pd.DataFrame(raw_data, columns = ['age', 'favorite_color', 'grade', 'name',])
df

   age favorite_color  grade              name
0   20           blue     88    Willard Morris
1   19           blue     95       Al Jennings
2   22         yellow     92      Omar Mullins
3   21          green     70  Spencer McDaniel

In [2]:
df[df['name'].str.contains('J')]

   age favorite_color  grade         name
1   19           blue     95  Al Jennings

In [3]:
df[~df['favorite_color'].str.contains('r')]

   age favorite_color  grade            name
0   20           blue     88  Willard Morris
1   19           blue     95     Al Jennings
2   22         yellow     92    Omar Mullins